# loop for  มีข้อดีคือ สามารถ ใช้กับ จำนวนรอบที่แน่นอน มีโครงสร้างดังนี้
'''
for in range(start,stop,step)     # กำหนดรอบการทำงาน
     start คือ ให้เริ่มต้นทำงานที่รอบใด
     stop  คือ ให้หยุดการทำงานที่รอบไหน
     Step  คือ พอครบจำนวน จะให้ทำอย่างไร เพิ่มค่า ลดค่า จำนวนเท่าไร
'''
#for i in range(3):    # range เริ่มต้นที่ตำแหน่ง 0,1,2...
                       # หากจะให้เริ่มรอบที่ตำแหน่ง 1 ให้ +1 เพิ่มเข้าไป
                       # for i range(1,6)คือทำงานตั้งแต่ 1 ถึง 5

summation = 0

for i in range(6):      # summation
    print("รอบที่ = ",i,"Hello World!")
    summation = i 
    print("ผลรวม = ", summation)