# โปรแกรมแลกเงินและหาจำนวนแบงค์

# 2000 => 1000 => 2 ใบ
# 1500 => 1000 => 1 ใบ , 500 = 1 ใบ
# 100  => 50   => 2 ใบ

number = int(input("กรุณาป้อนจำนวนเงินของคุณ :"))

# 2500
if number >= 1000:
    print("ธนบัตรใบละ 1000 บาท :",number // 1000,"ใบ")
    number %= 1000 # 2500 % 1000 = 500

if number >= 500:
    print("ธนบัตรใบละ 500 บาท :",number // 500,"ใบ")
    number %= 500

if number >= 100:
    print("ธนบัตรใบละ 100 บาท :",number // 100, "ใบ")
    number %= 100

if number >= 50:
    print("ธนบัตรใบละ 50 บาท :",number // 50, "ใบ")
    number %= 50

if number >= 20:
    print("ธนบัตรใบละ 20 บาท :",number // 20, "ใบ")
    number %= 20

if number >= 10:
    print("เหรียญ 10 บาท :",number // 10, "เหรียญ")
    number %= 10