# โครงสร้างควบคุมแบบทำซ้ำ
'''
 While คือ การทำงานซ้ำไปเรื่อยๆ ตามเงื่อนไขที่กำหนด ประกอบด้วย 
    expression คือ เงื่อนไขการทำงาน เมื่อเงื่อนไขเป็น "True"
    statement  คือ ให้ทำอะไร?
'''
# ตัวอย่าง

i = 1            # ตัวนับจำนวนรอบ
while i<=3:      # ถ้าตัวแปร น้อยกว่าหรือ เท่ากับ 3 
    print("Hello World") # กรณีนี่จะเกิด อินฟินิตี้ Loop**
 
            # เพิ่มเงื่อนไข เพื่อให้มีการจบการทำงาน คือทำให้เงื่อนไขเป็น "False"
    i = i+1 # ให้เพิ่มขึ้นทีละ 1 เมื่อถึง 4 ก็จะหลุดจากเงื่อนไข และ จบการทำงาน

# ตัวอย่าง 2

i = 1 
summation = 0        # เก็บผลการบวกเลขตามจำนวนรวม i 
# 1+2+3+4+5

while i<=5:
    summation += i    # เก็บผลรวมของ i ตามจำนวนรอบที่ทำงาน (1+ 2+3)
    i+=1       # 1,2,3,4,5
    print("รอบที่ = ", i ,"ค่า sum =",summation)


